// BitXor.c

#include <stdio.h>

int main(void)
{
	int num1 = 10; // 00000000 00000000 00000000 00001010
	int num2 = 20; // 00000000 00000000 00000000 00010100
	int num3 = 14; // 00000000 00000000 00000000 00001110

	int sum1 = num1 ^ num2; // 00000000 00000000 00000000 00011110
	int sum2 = num1 ^ num3; // 00000000 00000000 00000000 00000100
	int sum3 = num2 ^ num3; // 00000000 00000000 00000000 00011010

	printf("10과 20의 XOR 연산 결과 : %d\n", sum1);
	printf("10과 14의 XOR 연산 결과 : %d\n", sum2);
	printf("20과 14의 XOR 연산 결과 : %d\n", sum3);

	return 0;
}